[
	{"type":"h1", "content":"Inventory System"},
	{"type":"p", "content":"Languages/frameworks used: ", "italic":true},
	{"type":"", "content":"PHP, MySQL, "},
	{"type":"", "content":"Bootstrap", "link":"https://getbootstrap.com/"},
	{"type":"p", "content":"For my International Baccalaureate Internal Assessment for Computer Science, I wrote a secure inventory-management system for My Nonna's, a group of Italian restaurant stalls in schools in Singapore. It is a web application, written in PHP with MySQL, and it keeps a database of all items that the restaurants need to stock, and whether each restaurant has performed a stock-take on a given day. When stock-takes are performed, it keeps track of any items that need to be ordered, and communicates this information to the 'admin manager' who is responsible for contacting ingredient suppliers."},
	{"type":"p", "content":"The staff in each stall do a daily stock-take of the ingredients they have available. They use the system by scanning a special QR code, corresponding to a specific item, when that item needs to be re-ordered from the supplier. The QR codes contain a web link to a special web-page in the system, which writes the information about the item into a database table. The 'admin manager' then accesses a page which reads this table and displays all of the stalls' requests for items. When the day's stock-take is complete, the staff scan a special QR code to signal this to the admin manager."},
	{"type":"p", "content":"In order to ensure that there is no unauthorized ordering of ingredients or bad edits to the database, the system requires users to log in. It transmits and stores their login details securely, using PHP's implementations of bcrypt and SHA-256 for password hashing. I also made use of Bootstrap to make sure the pages of the application are laid out in a professional manner."},
	{"type":"h2", "content":"Project Documentation"},
	{"type":"p", "content":"This project was done in five stages:"},
	{"type":"p", "content":"Planning/Requirements - ", "bold":true},
	{"type":"", "content":"Find a client, and gather the requirements for the new system."},
	{"type":"p", "content":" - Letter from Client", "link":"projects/mynonnas/ClientLetter.pdf", "download":"download"},
	{"type":"p", "content":" - Requirements Document", "link":"projects/mynonnas/Requirements.pdf", "download":"download"},
	{"type":"p", "content":"Design - ", "bold":true},
	{"type":"", "content":"Create initial designs of the layout and behavior of various aspects of the new system, and show how it will be tested."},
	{"type":"p", "content":" - Database and UI Designs", "link":"projects/mynonnas/Designs.pdf", "download":"download"},
	{"type":"p", "content":" - Flowcharts", "link":"projects/mynonnas/Flowcharts.pdf", "download":"download"},
	{"type":"p", "content":" - Pseudocode for Order Report Page", "link":"projects/mynonnas/OrderReportPage.pdf", "download":"download"},
	{"type":"p", "content":" - Table of Test Cases", "link":"projects/mynonnas/TestTable.pdf", "download":"download"},
	{"type":"p", "content":"Development - ", "bold":true},
	{"type":"", "content":"Implement the new system, documenting the techniques used to ensure that the system is robust against incorrect and/or malicious data."},
	{"type":"p", "content":" - Implementation Details", "link":"projects/mynonnas/Implementation.pdf", "download":"download"},
	{"type":"p", "content":"Functionality - ", "bold":true},
	{"type":"", "content":"Test the new system and document how it should be used."},
	{"type":"p", "content":" - Demonstration Video", "link":"projects/mynonnas/Demonstration.mp4", "download":"download"},
	{"type":"p", "content":"Evaluation - ", "bold":true},
	{"type":"", "content":"Install the new system so that it can be used by the client, collect their feedback, and suggest ways to develop the system further."},
	{"type":"p", "content":" - Evaluation Document", "link":"projects/mynonnas/Demonstration.mp4", "download":"download"}
]